In [265]:
import pandas as pd #pandas

In [185]:
import numpy as np #다차원의 숫자 배열을 파이썬에서 효율적으로 처리하기 위한 모듈

In [186]:
import matplotlib.pyplot as plt

In [187]:
s = pd.Series([1,3,5,np.nan,6,8]) #pansdas 자료구조 Series 생성, 1차원 : index를 사용하여 참조

In [188]:
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

In [189]:
dates = pd.date_range('20130101', periods=6) #pandas 자료구조 DataFrame 생성, 2013-01-01을 기준으로 6개, 2차원:index,colunms

In [190]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D', tz=None)

In [191]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD')) 
#임의의 값을 가지는 6x4 DataFrame 생성, index는 dates, columns는 ABCD

In [192]:
df

                   A         B         C         D
2013-01-01 -1.513076  0.604704  0.092131 -0.446744
2013-01-02  0.443053 -0.377379  0.574053 -0.842635
2013-01-03 -0.937114 -1.466381  0.360486  1.175123
2013-01-04 -0.327016  2.190707  1.030997 -0.799858
2013-01-05 -1.364783  0.644855 -0.775839  1.074915
2013-01-06 -0.568484  0.141233  0.292353 -0.327674

In [193]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),#Series를 DataFrame에 넣기
                    'D' : np.array([3] * 4,dtype='int32'), #4개짜리 배열에 3의 값을 입력
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [194]:
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [195]:
df2.dtypes #각 columns의 데이터 타입을 출력

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [196]:
df.head() #마지막 행을 제외한 나머지 행을 출력

                   A         B         C         D
2013-01-01 -1.513076  0.604704  0.092131 -0.446744
2013-01-02  0.443053 -0.377379  0.574053 -0.842635
2013-01-03 -0.937114 -1.466381  0.360486  1.175123
2013-01-04 -0.327016  2.190707  1.030997 -0.799858
2013-01-05 -1.364783  0.644855 -0.775839  1.074915

In [197]:
df.head(2) #위에서 부터 2개의 행을 출력

                   A         B         C         D
2013-01-01 -1.513076  0.604704  0.092131 -0.446744
2013-01-02  0.443053 -0.377379  0.574053 -0.842635

In [198]:
df.tail(3) #아래에서 3개의 행을 출력

                   A         B         C         D
2013-01-04 -0.327016  2.190707  1.030997 -0.799858
2013-01-05 -1.364783  0.644855 -0.775839  1.074915
2013-01-06 -0.568484  0.141233  0.292353 -0.327674

In [199]:
df.index #Data Frame의 index를 출력

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D', tz=None)

In [200]:
df.columns #Data Frame의 각 열의 이름을 출력

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [201]:
df.values #Data Frame의 각 값을 출력

array([[-1.51307616,  0.60470391,  0.09213118, -0.44674445],
       [ 0.44305338, -0.37737904,  0.57405303, -0.84263509],
       [-0.93711431, -1.46638053,  0.36048627,  1.17512316],
       [-0.32701585,  2.19070652,  1.03099717, -0.79985778],
       [-1.36478333,  0.64485514, -0.77583854,  1.07491516],
       [-0.56848411,  0.14123265,  0.29235311, -0.32767393]])

In [202]:
df.describe() #Data Frame의 한 열의 갯수, 평균, 최소, 최대등을 표시

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.711237  0.289623  0.262364 -0.027812
std    0.724083  1.215734  0.600886  0.915257
min   -1.513076 -1.466381 -0.775839 -0.842635
25%   -1.257866 -0.247726  0.142187 -0.711579
50%   -0.752799  0.372968  0.326420 -0.387209
75%   -0.387383  0.634817  0.520661  0.724268
max    0.443053  2.190707  1.030997  1.175123

In [203]:
df.T #열과 행을 바꿔서 출력

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.513076    0.443053   -0.937114   -0.327016   -1.364783   -0.568484
B    0.604704   -0.377379   -1.466381    2.190707    0.644855    0.141233
C    0.092131    0.574053    0.360486    1.030997   -0.775839    0.292353
D   -0.446744   -0.842635    1.175123   -0.799858    1.074915   -0.327674

In [204]:
df.sort_index(axis=1, ascending=False) #열이름을 기준으로 역순으로 정렬

                   D         C         B         A
2013-01-01 -0.446744  0.092131  0.604704 -1.513076
2013-01-02 -0.842635  0.574053 -0.377379  0.443053
2013-01-03  1.175123  0.360486 -1.466381 -0.937114
2013-01-04 -0.799858  1.030997  2.190707 -0.327016
2013-01-05  1.074915 -0.775839  0.644855 -1.364783
2013-01-06 -0.327674  0.292353  0.141233 -0.568484

In [205]:
df.sort(columns='B') #B열의 값을 기준으로 행을 정렬

                   A         B         C         D
2013-01-03 -0.937114 -1.466381  0.360486  1.175123
2013-01-02  0.443053 -0.377379  0.574053 -0.842635
2013-01-06 -0.568484  0.141233  0.292353 -0.327674
2013-01-01 -1.513076  0.604704  0.092131 -0.446744
2013-01-05 -1.364783  0.644855 -0.775839  1.074915
2013-01-04 -0.327016  2.190707  1.030997 -0.799858

In [206]:
df['A'] #A열의 값만 출력

2013-01-01   -1.513076
2013-01-02    0.443053
2013-01-03   -0.937114
2013-01-04   -0.327016
2013-01-05   -1.364783
2013-01-06   -0.568484
Freq: D, Name: A, dtype: float64

In [207]:
df[0:3] #1행에서 3행까지 출력

                   A         B         C         D
2013-01-01 -1.513076  0.604704  0.092131 -0.446744
2013-01-02  0.443053 -0.377379  0.574053 -0.842635
2013-01-03 -0.937114 -1.466381  0.360486  1.175123

In [208]:
df['20130102':'20130104'] #index가 20130102이상 20130104미만은 행 출력

                   A         B         C         D
2013-01-02  0.443053 -0.377379  0.574053 -0.842635
2013-01-03 -0.937114 -1.466381  0.360486  1.175123
2013-01-04 -0.327016  2.190707  1.030997 -0.799858

In [209]:
#loc는 해당 위치의 값을 출력, index의 값이 옴.
df.loc[dates[0]] #1행의 값을 출력

A   -1.513076
B    0.604704
C    0.092131
D   -0.446744
Name: 2013-01-01 00:00:00, dtype: float64

In [210]:
df.loc[:,['A','B']] #인덱스 값이 A,B인 열을 출력

                   A         B
2013-01-01 -1.513076  0.604704
2013-01-02  0.443053 -0.377379
2013-01-03 -0.937114 -1.466381
2013-01-04 -0.327016  2.190707
2013-01-05 -1.364783  0.644855
2013-01-06 -0.568484  0.141233

In [211]:
df.loc['20130102':'20130104',['A','B']] #행의 인덱스가 20130102에서 20130104이며, 열의 인덱스가 A,B인 값을 출력

                   A         B
2013-01-02  0.443053 -0.377379
2013-01-03 -0.937114 -1.466381
2013-01-04 -0.327016  2.190707

In [212]:
df.loc['20130102',['A','B']] #행의 인덱스가 20130102이고, 열의 인덱스가 A,B인 값을 출력

A    0.443053
B   -0.377379
Name: 2013-01-02 00:00:00, dtype: float64

In [213]:
df.loc[dates[0],'A'] #행의 인덱스가 20130101이며, 열의 인덱스가 A인 값 출력

-1.5130761621515896

In [214]:
 df.at[dates[0],'A'] #위의 loc[dates[0],'A']와 같은 값을 가지지만 처리 속도가 빠르다

-1.5130761621515896

In [215]:
#iloc는 입력값이 정수만 넣을 수 있다.
df.iloc[3] #4번째 행의 값을 출력

A   -0.327016
B    2.190707
C    1.030997
D   -0.799858
Name: 2013-01-04 00:00:00, dtype: float64

In [216]:
df.iloc[3:5,0:2] #4~5번째행이며, 1~2번째 열의 값을 출력

                   A         B
2013-01-04 -0.327016  2.190707
2013-01-05 -1.364783  0.644855

In [217]:
df.iloc[[1,2,4],[0,2]] #행의 인덱스가 1,2,4(2,3,5행)이고, 열의 인덱스가 0,1(1,2행)을 출력

                   A         C
2013-01-02  0.443053  0.574053
2013-01-03 -0.937114  0.360486
2013-01-05 -1.364783 -0.775839

In [218]:
df.iloc[1:3,:] #2,3행을 출력

                   A         B         C         D
2013-01-02  0.443053 -0.377379  0.574053 -0.842635
2013-01-03 -0.937114 -1.466381  0.360486  1.175123

In [219]:
 df.iloc[:,1:3] #2,3열을 출력

                   B         C
2013-01-01  0.604704  0.092131
2013-01-02 -0.377379  0.574053
2013-01-03 -1.466381  0.360486
2013-01-04  2.190707  1.030997
2013-01-05  0.644855 -0.775839
2013-01-06  0.141233  0.292353

In [220]:
df.iloc[1,1] #2행2열값을 출력

-0.37737903665578665

In [221]:
df.iat[1,1] #2행2열값을 출력

-0.37737903665578665

In [222]:
df[df.A > 0] #A열의 값이 0보다 큰 행만 출력

                   A         B         C         D
2013-01-02  0.443053 -0.377379  0.574053 -0.842635

In [223]:
df[df > 0] #Data Frame df의 값이 0보다 작으면 NaN(Not a Number)를 출력

                   A         B         C         D
2013-01-01       NaN  0.604704  0.092131       NaN
2013-01-02  0.443053       NaN  0.574053       NaN
2013-01-03       NaN       NaN  0.360486  1.175123
2013-01-04       NaN  2.190707  1.030997       NaN
2013-01-05       NaN  0.644855       NaN  1.074915
2013-01-06       NaN  0.141233  0.292353       NaN

In [224]:
df2 = df.copy() #Data Frame df를 복사

In [225]:
df2['E'] = ['one', 'one','two','three','four','three'] #E열의 값을 수정

In [226]:
df2

                   A         B         C         D      E
2013-01-01 -1.513076  0.604704  0.092131 -0.446744    one
2013-01-02  0.443053 -0.377379  0.574053 -0.842635    one
2013-01-03 -0.937114 -1.466381  0.360486  1.175123    two
2013-01-04 -0.327016  2.190707  1.030997 -0.799858  three
2013-01-05 -1.364783  0.644855 -0.775839  1.074915   four
2013-01-06 -0.568484  0.141233  0.292353 -0.327674  three

In [227]:
#isin(입력), 입력된 값 중에서 해당 되는 값이 있으면 참, 없으면 거짓
df2[df2['E'].isin(['two','four'])] #E열 값이 two와 four인 행 출력

                   A         B         C         D     E
2013-01-03 -0.937114 -1.466381  0.360486  1.175123   two
2013-01-05 -1.364783  0.644855 -0.775839  1.074915  four

In [228]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6)) #행의 인덱스는 20130102~20130107이며 각 행의 값은 1~6을 가진 Series 생성

In [229]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [230]:
df['F'] = s1 #Data Frame df의 f열을 Series S1으로 수정

In [231]:
df.at[dates[0],'A'] = 0 #1행의 A열의 값을 0으로 설정

In [232]:
df.iat[0,1] = 0 #1행의 2번째열(B열)의 값을 0으로 설정

In [233]:
#len은 입력된 자료구조의 길이
df.loc[:,'D'] = np.array([5] * len(df)) #D열의 값을 5로 설정

In [234]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  0.092131  5 NaN
2013-01-02  0.443053 -0.377379  0.574053  5   1
2013-01-03 -0.937114 -1.466381  0.360486  5   2
2013-01-04 -0.327016  2.190707  1.030997  5   3
2013-01-05 -1.364783  0.644855 -0.775839  5   4
2013-01-06 -0.568484  0.141233  0.292353  5   5

In [235]:
df2 = df.copy()

In [236]:
df2[df2 > 0] = -df2 #df2의 값이 0보다 크면 -로 수정

In [237]:
df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.092131 -5 NaN
2013-01-02 -0.443053 -0.377379 -0.574053 -5  -1
2013-01-03 -0.937114 -1.466381 -0.360486 -5  -2
2013-01-04 -0.327016 -2.190707 -1.030997 -5  -3
2013-01-05 -1.364783 -0.644855 -0.775839 -5  -4
2013-01-06 -0.568484 -0.141233 -0.292353 -5  -5

In [238]:
#reindex : 입력된 인덱스를 수정
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E']) #행 인덱스를 1~4행까지 유지하고,(dates에서 불러옴) 열은 기존의 ABCDF에 E를 추가

In [239]:
df1.loc[dates[0]:dates[1],'E'] = 1 #1,2행의 E열 값을 1로 설정

In [240]:
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000  0.092131  5 NaN   1
2013-01-02  0.443053 -0.377379  0.574053  5   1   1
2013-01-03 -0.937114 -1.466381  0.360486  5   2 NaN
2013-01-04 -0.327016  2.190707  1.030997  5   3 NaN

In [241]:
#dropna : NA 값이 있으면 버림, how='any' 이면 NA가 하나라도 있으면, 'all'이면 전부 NA이면 드랍
df1.dropna(how='any')

                   A         B         C  D  F  E
2013-01-02  0.443053 -0.377379  0.574053  5  1  1

In [242]:
#fillna : 값이 NA/NAN이면 지정된 값으로 설정
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000  0.092131  5  5  1
2013-01-02  0.443053 -0.377379  0.574053  5  1  1
2013-01-03 -0.937114 -1.466381  0.360486  5  2  5
2013-01-04 -0.327016  2.190707  1.030997  5  3  5

In [243]:
#NUMLL값이면 True, 아니면 False
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [244]:
#mean : 평균, 입력이 0이면 열의 평균을, 1이면 행의 평균을 계산
df.mean() #각열의 평균을 계산

A   -0.459057
B    0.188839
C    0.262364
D    5.000000
F    3.000000
dtype: float64

In [245]:
df.mean(1) #행의 평균을 계산

2013-01-01    1.273033
2013-01-02    1.327945
2013-01-03    0.991398
2013-01-04    2.178938
2013-01-05    1.500847
2013-01-06    1.973020
Freq: D, dtype: float64

In [246]:
#shift : 입력된 값만큼 값들을 이동시키고 빈 공간은 NAN으로 채움
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [247]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(1)
s

2013-01-01   NaN
2013-01-02     1
2013-01-03     3
2013-01-04     5
2013-01-05   NaN
2013-01-06     6
Freq: D, dtype: float64

In [248]:
#sub : 값 중에 NaN이 있는 행 또는 열을 뺀다.
#sub(other, axis='columns', level=None, fill_value=None)
#ohter : Series, DataFrame, constant, 
#axis : {0,1, index’,‘columns’}
#level : int or name
#fill_value : None or float value, default None
df.sub(s, axis='index')

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02 -0.556947 -1.377379 -0.425947   4   0
2013-01-03 -3.937114 -4.466381 -2.639514   2  -1
2013-01-04 -5.327016 -2.809293 -3.969003   0  -2
2013-01-05       NaN       NaN       NaN NaN NaN
2013-01-06 -6.568484 -5.858767 -5.707647  -1  -1

In [249]:
#apply(func, axis=0, broadcast=False, raw=False, reduce=None, args=())
#입력된 함수를 적용
df.apply(np.cumsum) #cumsum : 각 열을 기준으로 합을 누적함

                   A         B         C   D   F
2013-01-01  0.000000  0.000000  0.092131   5 NaN
2013-01-02  0.443053 -0.377379  0.666184  10   1
2013-01-03 -0.494061 -1.843760  1.026670  15   3
2013-01-04 -0.821077  0.346947  2.057668  20   6
2013-01-05 -2.185860  0.991802  1.281829  25  10
2013-01-06 -2.754344  1.133035  1.574182  30  15

In [250]:
df.apply(lambda x: x.max() - x.min()) #각 열의 최댓값에서 최소값을 뺀 값

A    1.807837
B    3.657087
C    1.806836
D    0.000000
F    4.000000
dtype: float64

In [251]:
s = pd.Series(np.random.randint(0, 7, size=10)) #10개의 0~7사이에 값을 가지는 Series를 생성

In [252]:
s

0    5
1    1
2    5
3    6
4    4
5    5
6    5
7    0
8    3
9    2
dtype: int32

In [253]:
s.value_counts() #각 값이 몇개씩 있는지 출력

5    4
6    1
4    1
3    1
2    1
1    1
0    1
dtype: int64

In [254]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [255]:
s.str.lower() #전부 소문자로 변환

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [256]:
df = pd.DataFrame(np.random.randn(10, 4)) #10x4 DataFrame 생성
df

          0         1         2         3
0 -1.642914 -0.208356  1.418530 -0.440036
1 -0.865972 -0.722123 -0.037375  0.811196
2  0.648341 -1.518522 -0.255443  1.399477
3  0.900985 -1.139484 -0.502062 -0.174960
4 -1.325474 -0.222648  0.836373 -1.054295
5  1.627675 -1.172957  0.103794  1.961355
6 -1.024244  0.004232  1.297948  0.155768
7  0.409316 -1.099715 -0.614608  1.293076
8  0.928723  0.436442 -2.436334  0.956484
9  0.658368  0.873911 -0.905478  0.575809

In [257]:
pieces = [df[:3], df[3:7], df[7:]]

In [258]:
pieces

[          0         1         2         3
 0 -1.642914 -0.208356  1.418530 -0.440036
 1 -0.865972 -0.722123 -0.037375  0.811196
 2  0.648341 -1.518522 -0.255443  1.399477,
           0         1         2         3
 3  0.900985 -1.139484 -0.502062 -0.174960
 4 -1.325474 -0.222648  0.836373 -1.054295
 5  1.627675 -1.172957  0.103794  1.961355
 6 -1.024244  0.004232  1.297948  0.155768,
           0         1         2         3
 7  0.409316 -1.099715 -0.614608  1.293076
 8  0.928723  0.436442 -2.436334  0.956484
 9  0.658368  0.873911 -0.905478  0.575809]

In [259]:
pd.concat(pieces) #3개로 나뉜 pieces를 하나로 이어줌

          0         1         2         3
0 -1.642914 -0.208356  1.418530 -0.440036
1 -0.865972 -0.722123 -0.037375  0.811196
2  0.648341 -1.518522 -0.255443  1.399477
3  0.900985 -1.139484 -0.502062 -0.174960
4 -1.325474 -0.222648  0.836373 -1.054295
5  1.627675 -1.172957  0.103794  1.961355
6 -1.024244  0.004232  1.297948  0.155768
7  0.409316 -1.099715 -0.614608  1.293076
8  0.928723  0.436442 -2.436334  0.956484
9  0.658368  0.873911 -0.905478  0.575809

In [260]:
left = pd.DataFrame({'key': ['foo', 'fou'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [261]:
left

   key  lval
0  foo     1
1  fou     2

In [262]:
right

   key  rval
0  foo     4
1  foo     5

In [263]:
#merge : 두 개의 DataFrame을 같은 key를 가지는 값들을 병합
pd.merge(left, right, on='key') #key를 기준으로 모든 경우 생성

   key  lval  rval
0  foo     1     4
1  foo     1     5

In [264]:
pd.merge(left, right)

   key  lval  rval
0  foo     1     4
1  foo     1     5

In [269]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.578027  0.758786 -1.990019  1.527017
1  1.278350 -0.750487 -0.486999  1.124863
2 -0.189625  0.114180 -0.617367  0.625983
3  0.607378 -1.124722  0.358640  2.448029
4  0.022225 -0.055501  0.006948  0.564501
5  0.589539 -0.420650  0.148842  0.836122
6  1.827379 -1.995342 -0.945762  0.247441
7  0.798419  0.432710  0.751716  0.370464

In [273]:
s = df.iloc[3] #df에서 4행을 추출하여 s로 만듬

In [277]:
#append Data를 이어 붙임
df.append(s, ignore_index=False) #ignore_index가 false이면 인덱스가 중복되던지 아닌지 신경안씀

          A         B         C         D
0 -0.578027  0.758786 -1.990019  1.527017
1  1.278350 -0.750487 -0.486999  1.124863
2 -0.189625  0.114180 -0.617367  0.625983
3  0.607378 -1.124722  0.358640  2.448029
4  0.022225 -0.055501  0.006948  0.564501
5  0.589539 -0.420650  0.148842  0.836122
6  1.827379 -1.995342 -0.945762  0.247441
7  0.798419  0.432710  0.751716  0.370464
3  0.607378 -1.124722  0.358640  2.448029

In [279]:
df.append(s, ignore_index=True) #ignore_index가 True이면 인덱스가 중복되지 않도록 이후 인덱스를 붙여준다.

          A         B         C         D
0 -0.578027  0.758786 -1.990019  1.527017
1  1.278350 -0.750487 -0.486999  1.124863
2 -0.189625  0.114180 -0.617367  0.625983
3  0.607378 -1.124722  0.358640  2.448029
4  0.022225 -0.055501  0.006948  0.564501
5  0.589539 -0.420650  0.148842  0.836122
6  1.827379 -1.995342 -0.945762  0.247441
7  0.798419  0.432710  0.751716  0.370464
8  0.607378 -1.124722  0.358640  2.448029

In [280]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three',
                            'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.301028 -0.994413
1  bar    one  0.205700  0.468257
2  foo    two  0.067261  0.367087
3  bar  three  0.755138 -0.884342
4  foo    two  0.364562 -0.404928
5  bar    two  1.062068 -0.945326
6  foo    one -1.170176 -0.077675
7  foo  three  0.045784  0.057504

In [281]:
df.groupby('A').sum() #A열 값이 같은 값들의 합을 계산

            C         D
A
bar  2.022906 -1.361411
foo -0.993598 -1.052424

In [282]:
df.groupby(['A','B']).sum() #A와 B열의 값이 같은 값들의 합을 계산

                  C         D
A   B
bar one    0.205700  0.468257
    three  0.755138 -0.884342
    two    1.062068 -0.945326
foo one   -1.471204 -1.072087
    three  0.045784  0.057504
    two    0.431823 -0.037841

In [286]:
#리스트를 섞음
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                      'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [288]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second']) #
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B']) #8x2 DataFrame 생성
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.524646  0.310810
      two     0.598462  0.282524
baz   one    -0.387977 -0.813862
      two    -1.251758 -0.798272

In [290]:
#stack() 열의 수준을 낮춤
stacked = df2.stack()
stacked #first, second, A, B의 4개의 열에서 first, second 2개의 열로 줌

first  second
bar    one     A    0.524646
               B    0.310810
       two     A    0.598462
               B    0.282524
baz    one     A   -0.387977
               B   -0.813862
       two     A   -1.251758
               B   -0.798272
dtype: float64

In [291]:
stacked.unstack() #열의 수준을 다시 되돌림, -1이 생략됨

                     A         B
first second
bar   one     0.524646  0.310810
      two     0.598462  0.282524
baz   one    -0.387977 -0.813862
      two    -1.251758 -0.798272

In [297]:
stacked.unstack(1)

second        one       two
first
bar   A  0.524646  0.598462
      B  0.310810  0.282524
baz   A -0.387977 -1.251758
      B -0.813862 -0.798272

In [298]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.524646 -0.387977
       B  0.310810 -0.813862
two    A  0.598462 -1.251758
       B  0.282524 -0.798272

In [299]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                    'B' : ['A', 'B', 'C'] * 4,
                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                    'D' : np.random.randn(12),
                    'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.271614  0.599036
1     one  B  foo -1.516375  0.670546
2     two  C  foo -0.519275 -0.813023
3   three  A  bar -0.479906  0.122251
4     one  B  bar  1.295928  1.246468
5     one  C  bar -1.463996 -0.525006
6     two  A  foo -0.224096  1.893988
7   three  B  foo  1.181820  1.242073
8     one  C  foo  0.132795 -0.193988
9     one  A  bar -1.005737 -1.248332
10    two  B  bar -0.256160 -0.244993
11  three  C  bar -1.044313  2.312316

In [300]:
# 인덱스는 A,B열의 값, key는 C열의 값
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C']) #스프레드 쉬트의 피번 테이블 생성,

C             bar       foo
A     B
one   A -1.005737 -0.271614
      B  1.295928 -1.516375
      C -1.463996  0.132795
three A -0.479906       NaN
      B       NaN  1.181820
      C -1.044313       NaN
two   A       NaN -0.224096
      B -0.256160       NaN
      C       NaN -0.519275

In [302]:
rng = pd.date_range('1/1/2012', periods=100, freq='S') #2012-01-01 0초를 기준으로 100개의 날짜를 생성

In [303]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng) #100개의 0에서 500사이의 정수를 갖는 Series 생성, 인덱스는 위에서 생성한 날짜

In [312]:
ts.resample('1Min', how='sum') #초 단위로 생성한 ts를 1분 단위로 수정하고, 누락된 값들은 합한다.

2012-01-01 00:00:00    13368
2012-01-01 00:01:00     9842
Freq: T, dtype: int32

In [313]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D') #시간 간격이 day

In [314]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [315]:
ts

2012-03-06   -2.447320
2012-03-07    1.116438
2012-03-08    0.045486
2012-03-09    0.484208
2012-03-10    1.420781
Freq: D, dtype: float64

In [316]:
ts_utc = ts.tz_localize('UTC') #타임존이 UTC
ts_utc

2012-03-06 00:00:00+00:00   -2.447320
2012-03-07 00:00:00+00:00    1.116438
2012-03-08 00:00:00+00:00    0.045486
2012-03-09 00:00:00+00:00    0.484208
2012-03-10 00:00:00+00:00    1.420781
Freq: D, dtype: float64

In [317]:
ts_utc.tz_convert('US/Eastern') #타임존이 US/Eastern

2012-03-05 19:00:00-05:00   -2.447320
2012-03-06 19:00:00-05:00    1.116438
2012-03-07 19:00:00-05:00    0.045486
2012-03-08 19:00:00-05:00    0.484208
2012-03-09 19:00:00-05:00    1.420781
Freq: D, dtype: float64

In [318]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31   -0.066919
2012-02-29   -0.867478
2012-03-31    0.211919
2012-04-30   -0.230757
2012-05-31   -0.548950
Freq: M, dtype: float64

In [322]:
ps = ts.to_period() #freq 이하는 삭제, freq가 Month이므로 day이하는 삭제
ps

2012-01   -0.066919
2012-02   -0.867478
2012-03    0.211919
2012-04   -0.230757
2012-05   -0.548950
Freq: M, dtype: float64

In [323]:
ps.to_timestamp() #기간의 시작일을 출력

2012-01-01   -0.066919
2012-02-01   -0.867478
2012-03-01    0.211919
2012-04-01   -0.230757
2012-05-01   -0.548950
Freq: MS, dtype: float64

In [329]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [330]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [331]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9 
#1990Q1를 1990-03-00으로 바꾸고 +1를 하여 1990-03-01로 수정
#1990-03-01에서 09:00를 추가

In [333]:
ts.head() #처음부터 n개 행을 출력(기본 5개)

1990-03-01 09:00   -0.114659
1990-06-01 09:00   -0.803400
1990-09-01 09:00   -1.049711
1990-12-01 09:00    0.650776
1991-03-01 09:00   -1.287859
Freq: H, dtype: float64

In [338]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [342]:
df["grade"] = df["raw_grade"].astype("category") #grade를 생성하는데 그 값으로 raw_grade의 값을 넣어준다.

In [343]:
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [344]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [347]:
df["grade"].cat.categories = ["very good", "good", "very bad"] #a,b,e -> very good, good, very bad로 수정
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): [very good, good, very bad]

In [349]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"]) #카테 고리를 설정
df.sort("grade") #grade를 기준으로 정렬

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [350]:
df.groupby("grade").size() #grade의 카테고리의 값의 수를 출력

grade
very bad      1
bad         NaN
medium      NaN
good          2
very good     3
dtype: float64

In [356]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))

In [357]:
ts = ts.cumsum()

In [364]:
ts.plot()

AttributeError: 'Series' object has no attribute 'ylabel'